perfromance-tests/result.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /users/octocat
Document Length:        202 bytes

Concurrency Level:      100
Time taken for tests:   134.422 seconds
Complete requests:      100000
Failed requests:        0
Total transferred:      30700000 bytes
HTML transferred:       20200000 bytes
Requests per second:    743.93 [#/sec] (mean)
Time per request:       134.422 [ms] (mean)
Time per request:       1.344 [ms] (mean, across all concurrent requests)
Transfer rate:          223.03 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       8
Processing:     6  134  63.9    117    1096
Waiting:        6  134  63.9    117    1096
Total:          6  134  64.0    117    1096

Percentage of the requests served within a certain time (ms)
  50%    117
  66%    127
  75%    135
  80%    143
  90%    205
  95%    307
  98%    339
  99%    362
 100%   1096 (longest request)